// 1 створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// function numbers(a, b, c) {
//     if (a < b && a < c) {
//         console.log('a');
//     }else if (b < a && b < c) {
//         console.log('b');
//     }else if (c < a && c < b) {
//         console.log('c');
//     }
// }
// numbers(5,3, 95);

// 2 створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// function numbers(a, b, c) {
//     if (a > b && a > c) {
//         console.log(`${a}`);
//     }else if (b > a && b > c) {
//             console.log(`${b}`);
//     }else {
//         console.log(`${c}`);
//     }
// }
// numbers(7,754, 95);

// 3 створити функцію яка повертає найбільше число з масиву
// let numbers = [25, 34, 15, 5124, 2021, 2];
//
// function maxNumber(number) {
//     let max = number[0];
//     for (const max1 of number) {
//         if (max1 > max) {
//             max = max1;
//         }
//     }
//         return max;
// }
// document.write(maxNumber(numbers));

// 4 створити функцію яка повертає найменьше число з масиву
// let numbers = [25, 34, 15, 5124, 2021, 2];
//
// function minNumber(number) {
//     let min = number[0];
//     for (const min1 of number) {
//         if (min1 < min) {
//             min = min1;
//         }
//     }
//     return min;
// }
// document.write(minNumber(numbers));

// 5 створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
let numbers = [25, 34, 15, 5124, 2021, 2];

function sumNumbers(numbers) {
    let result = 0;
    for (const number of numbers) {


    }

}
// 6 створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

// 7 створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);

// 8 створити функцію яка заповнює масив рандомними числами

// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.

// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.

// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].



